{
  "projects": [
    {
      "id": "1",
      "slug": "1",
      "title": "Сервис продвижения на маркетплейсах",
      "shortDescription": "Сервис аналитики и продвижения для продавцов WB/Ozon",
      "fullDescription": "Разработал фронтенд модуля техподдержки на Vue 3 в рамках монолитного приложения. Реализовал систему тикетов, мессенджер и админ-панель для операторов.",
      "detailedDescription": "Mpb.TOP — SaaS-платформа для продавцов на маркетплейсах Wildberries, Ozon и Яндекс Маркет, объединяющая инструменты аналитики, продвижения товаров и автоматизации бизнес-процессов. В рамках проекта я разработал фронтенд модуля технической поддержки на Vue 3, интегрированного в монолитную архитектуру на Laravel. Модуль включает систему тикетов с приоритизацией, уведомлениями и историей обращений, мессенджер для связи с поддержкой, а также админ-панель для операторов с просмотром статистики и шаблонами быстрых ответов.",
      "developmentExperience": "Это был мой первый опыт интеграции Vue 3 в монолитную архитектуру Laravel. Основной вызов — отсутствие HMR и необходимость полного ребилда фронтенда в Docker при каждом изменении, что значительно усложняло отладку. Я выстроил эффективный workflow для работы в таких условиях, научился минимизировать циклы итераций и писать код, требующий меньше отладки. Работал в паре с backend-разработчиком над проектированием API и структуры данных.",
      "careerAchievements": [
        "Разработал полноценный модуль техподдержки с нуля — от проектирования до продакшена",
        "Снизил время отклика службы поддержки благодаря системе приоритизации тикетов",
        "Успешно интегрировал Vue 3 SPA в монолитную архитектуру Laravel"
      ],
      "personalGrowth": [
        "Освоил интеграцию Vue 3 в монолитные приложения",
        "Научился эффективно работать без HMR в Docker-окружении",
        "Получил опыт проектирования UI для систем техподдержки",
        "Улучшил навыки работы в паре с backend-разработчиком"
      ],
      "technologies": ["Vue 3", "Laravel", "Docker", "REST API"],
      "type": "commercial",
      "year": 2025,
      "status": "completed",
      "image": "/projects/project-2/mobile-page.png",
      "link": "https://mpb-top.ru/",
      "features": [
        "Мессенджер техподдержки",
        "Система тикетов",
        "Админ-панель операторов",
        "Интеграция с платформой"
      ],
      "screenshots": [],
      "hoursSpent": 320,
      "complexity": 8,
      "team": "2 человека",
      "duration": "2 месяца"
    },
    {
      "id": "2",
      "slug": "2",
      "title": "Платформа мониторинга поставок",
      "shortDescription": "Платформа мониторинга поставок с адаптивным дашбордом",
      "fullDescription": "Реализовал адаптивную верстку на основе готового desktop-макета. Проводил систематический дебаг и рефакторинг существующей кодовой базы.",
      "detailedDescription": "V1T — B2B платформа для мониторинга логистических поставок. Я подключился к проекту с уже готовой desktop-версией и отвечал за адаптацию интерфейса под мобильные устройства и планшеты. Параллельно занимался дебагом существующей реализации — находил и исправлял баги в логике компонентов, оптимизировал проблемные участки кода.",
      "developmentExperience": "Основной вызов проекта — работа с чужой кодовой базой. Большую часть времени занимало чтение и понимание существующего кода, прежде чем вносить изменения. Это научило меня быстро ориентироваться в незнакомых проектах, понимать архитектурные решения других разработчиков и аккуратно интегрировать свои изменения, не ломая существующую функциональность.",
      "careerAchievements": [
        "Реализовал полную адаптивную версию платформы на основе desktop-макета",
        "Выявил и исправил критические баги в существующей реализации",
        "Успешно работал с legacy-кодом без документации"
      ],
      "personalGrowth": [
        "Научился быстро разбираться в чужом коде",
        "Освоил подходы к адаптивной верстке сложных дашбордов",
        "Получил опыт работы с Next.js в коммерческом проекте",
        "Улучшил навыки дебага и code review"
      ],
      "technologies": ["Next.js", "TypeScript", "Tailwind CSS"],
      "type": "commercial",
      "year": 2025,
      "status": "in-progress",
      "image": "/projects/v1t.jpg",
      "link": null,
      "features": [
        "Адаптивный дашборд",
        "Визуализация данных",
        "Система отчетов"
      ],
      "screenshots": [],
      "hoursSpent": 280,
      "complexity": 6,
      "team": "3 человека",
      "duration": "2.5 месяца"
    },
    {
      "id": "3",
      "slug": "3",
      "title": "Платформа подбора IT-специалистов",
      "shortDescription": "Платформа для поиска IT-специалистов на Nuxt.js",
      "fullDescription": "Разработал систему уведомлений, библиотеку переиспользуемых компонентов и email-шаблоны. Менторил младших разработчиков в команде.",
      "detailedDescription": "Платформа для подбора IT-специалистов на проектную работу — своего рода LinkedIn для фрилансеров и компаний. В рамках проекта я отвечал за разработку системы уведомлений на Nuxt.js 3, создание библиотеки переиспользуемых UI-компонентов и вёрстку email-шаблонов для рассылок пользователям. Параллельно выступал в роли ментора для младших разработчиков — проводил code review, помогал с архитектурными решениями и онбордингом в проект.",
      "developmentExperience": "Проект дал мне второй серьёзный опыт менторства. Учился объяснять сложные концепции простым языком, давать конструктивную обратную связь на code review и находить баланс между «сделать самому» и «дать разобраться джуну». Отдельным вызовом была вёрстка email-писем — ограничения почтовых клиентов требуют совершенно другого подхода, чем обычная веб-разработка: inline-стили, табличная вёрстка, тестирование в десятках клиентов.",
      "careerAchievements": [
        "Создал библиотеку переиспользуемых UI-компонентов для проекта",
        "Разработал систему уведомлений с различными типами алертов",
        "Реализовал кроссклиентные email-шаблоны для рассылок",
        "Менторил 2 младших разработчиков"
      ],
      "personalGrowth": [
        "Получил опыт менторства и проведения code review",
        "Освоил особенности вёрстки email-писем",
        "Научился создавать переиспользуемые компонентные системы",
        "Улучшил навыки коммуникации в команде"
      ],
      "technologies": ["Nuxt.js", "Vue 3", "TypeScript", "Pinia"],
      "type": "commercial",
      "year": 2024,
      "status": "completed",
      "image": "/projects/project-4/mobile-page.png",
      "link": "https://contractis.ru",
      "features": [
        "Система уведомлений",
        "UI-компоненты",
        "Email-шаблоны",
        "Профили специалистов"
      ],
      "screenshots": [],
      "hoursSpent": 380,
      "complexity": 5,
      "team": "5 человек",
      "duration": "3 месяца"
    },
    {
      "id": "4",
      "slug": "4",
      "title": "Корпоративная CRM-система",
      "shortDescription": "Внутренняя CRM-система предприятия на Vue 3",
      "fullDescription": "Разработал фронтенд ключевых страниц корпоративной CRM: модуль техподдержки, корзину и интерфейс управления осмотрами.",
      "detailedDescription": "Внутренняя CRM-система для крупного предприятия, объединяющая управление техническими и медицинскими осмотрами сотрудников, систему заявок и внутреннюю техподдержку. Я отвечал за разработку фронтенда нескольких ключевых модулей на Vue 3: страница технической поддержки с формами обращений, корзина заявок, а также интерфейс для управления записями осмотров — добавление, редактирование и удаление. Работал с существующим backend API, интегрировал формы с валидацией и обработкой ошибок.",
      "developmentExperience": "Проект дал опыт работы с закрытой корпоративной системой, где важна точность и надёжность интерфейсов. Работал с большим количеством форм и таблиц, учился выстраивать консистентный UX в рамках существующего дизайн-кода. Взаимодействовал с backend-командой для уточнения контрактов API и обработки edge-кейсов.",
      "careerAchievements": [
        "Реализовал с нуля несколько ключевых страниц корпоративной CRM",
        "Разработал интерфейс управления осмотрами с поддержкой CRUD-операций",
        "Интегрировал фронтенд с существующим backend API"
      ],
      "personalGrowth": [
        "Получил опыт работы с закрытыми корпоративными системами",
        "Освоил построение сложных форм на Vue 3",
        "Научился работать в рамках существующей архитектуры и код-стайла",
        "Улучшил навыки взаимодействия с backend-командой"
      ],
      "technologies": ["Vue 3", "TypeScript", "REST API"],
      "type": "commercial",
      "year": 2024,
      "status": "completed",
      "image": "/projects/enterprise-crm.jpg",
      "link": null,
      "features": [
        "Модуль техподдержки",
        "Корзина заявок",
        "Управление осмотрами",
        "Интеграция с корпоративным API"
      ],
      "screenshots": [],
      "hoursSpent": 520,
      "complexity": 10,
      "team": "3 человек",
      "duration": "4 месяца"
    },
    {
      "id": "5",
      "slug": "5",
      "title": "ProfTeam Platform",
      "shortDescription": "Образовательная IT-платформа для студентов и компаний",
      "fullDescription": "Разработал модуль вакансий и потребностей с системой фильтрации и пагинации. Проводил рефакторинг и фикс багов существующего функционала.",
      "detailedDescription": "ProfTeam — образовательная платформа для связи IT-компаний и студентов технических вузов. Компании размещают стажировки и вакансии, студенты проходят образовательные треки и откликаются на позиции. Я разработал модуль вакансий и потребностей на Vue.js — реализовал систему фильтрации, поиска и пагинации. Параллельно занимался систематическим исправлением багов и рефакторингом существующего кода, опираясь на документацию и best-practices.",
      "developmentExperience": "Это был мой первый проект с объёмной бизнес-логикой. Главный вызов — реализация фильтрации и пагинации для страниц с несколькими независимыми списками. Нужно было продумать, как синхронизировать состояние фильтров и поиска, когда на странице больше двух списков с разными данными. Много времени уделял чтению документации Vue.js и изучению best-practices, чтобы писать более качественный код. Параллельно рефакторил существующий функционал — это научило разбираться в чужом коде и улучшать его без поломок.",
      "careerAchievements": [
        "Реализовал модуль вакансий и потребностей с нуля",
        "Разработал систему фильтрации и пагинации для страниц с множественными списками",
        "Провёл рефакторинг существующего кода с улучшением читаемости и поддерживаемости"
      ],
      "personalGrowth": [
        "Освоил работу со сложной бизнес-логикой на Vue.js",
        "Научился проектировать системы фильтрации для множественных списков",
        "Выработал привычку изучать документацию и best-practices",
        "Получил опыт рефакторинга и работы с legacy-кодом"
      ],
      "technologies": ["Vue.js", "JavaScript", "REST API", "SCSS"],
      "type": "education",
      "year": 2023,
      "status": "completed",
      "image": "/projects/profteam.jpg",
      "link": null,
      "features": [
        "Модуль вакансий",
        "Система фильтрации",
        "Пагинация списков",
        "REST API интеграция"
      ],
      "screenshots": [],
      "hoursSpent": 240,
      "complexity": 6,
      "team": "10 человека",
      "duration": "2 месяца"
    },
    {
      "id": "6",
      "slug": "6",
      "title": "Genius AI",
      "shortDescription": "AI-платформа для генерации контента (OpenAI API)",
      "fullDescription": "Платформа для генерации различных типов контента с использованием OpenAI API. Реализовал интеграцию с GPT-4, систему токенов и тарифов.",
      "detailedDescription": "Genius AI — это SaaS платформа для генерации различного контента: текстов, кода, изображений (через DALL-E), музыки (через API третьих сторон). Моя pet-project идея была создать единую платформу для всех AI инструментов. Разработал frontend на Vue 3 с Composition API и backend на Node.js. Интегрировал OpenAI API (GPT-4 для текстов, DALL-E для изображений), Replicate API для генерации музыки. Реализовал систему токенов: пользователи покупают токены, каждый запрос стоит определенное количество токенов в зависимости от модели. Создал тарифные планы (Free, Pro, Enterprise) с разными лимитами. Использовал MongoDB для хранения истории генераций, Stripe для приема платежей.",
      "developmentExperience": "Это был мой первый опыт работы с AI API и создания полноценного SaaS продукта. Основные вызовы: управление затратами на API (GPT-4 дорогой), реализация rate limiting чтобы пользователи не превышали лимиты, обработка streaming responses от GPT-4 для real-time вывода текста. Изучил работу со Stripe API для подписок и one-time платежей, внедрил webhooks для обработки событий. Столкнулся с задачей хранения больших объемов сгенерированного контента — использовал S3-совместимое хранилище для изображений и аудио. Проект научил меня думать как продукт-менеджер: анализировал метрики, A/B тестировал цены.",
      "careerAchievements": [
        "Создал полноценный SaaS продукт от идеи до MVP за 3 месяца",
        "Интегрировал 5 различных AI API в единую платформу",
        "Реализовал систему монетизации через Stripe с тремя тарифами"
      ],
      "personalGrowth": [
        "Освоил работу с OpenAI API и prompt engineering",
        "Изучил Stripe API и реализацию подписок",
        "Получил опыт создания SaaS продуктов",
        "Научился работать с MongoDB и S3 storage"
      ],
      "technologies": ["Vue 3", "Node.js", "OpenAI API", "MongoDB"],
      "type": "pet",
      "year": 2023,
      "status": "deprecated",
      "image": "/projects/genius-ai.jpg",
      "link": null,
      "features": [
        "Интеграция с OpenAI GPT-4",
        "Система токенов",
        "Множество типов контента",
        "Управление тарифами"
      ],
      "screenshots": [],
      "hoursSpent": 180,
      "complexity": 7,
      "duration": "3 месяца"
    },
    {
      "id": "7",
      "slug": "7",
      "title": "Ecommerce Platform",
      "shortDescription": "Интернет-магазин с админ-панелью",
      "fullDescription": "Полноценный интернет-магазин с каталогом товаров, корзиной, системой заказов и админ-панелью для управления.",
      "detailedDescription": "Ecommerce Platform — это мой учебный проект для освоения MERN стека (MongoDB, Express, React, Node.js). Реализовал полный цикл интернет-магазина: каталог товаров с категориями и фильтрацией, поиск с автодополнением, корзину с расчетом доставки, оформление заказа с интеграцией платежей, личный кабинет с историей заказов. Для админов создал панель управления: добавление/редактирование товаров с загрузкой изображений, управление заказами (статусы, трекинг), управление пользователями, дашборд с аналитикой продаж. Использовал JWT для авторизации, Cloudinary для хостинга изображений, Nodemailer для email уведомлений.",
      "developmentExperience": "Проект стал моим полигоном для отработки fullstack разработки. Изучил построение RESTful API с правильной структурой (controllers, models, routes, middlewares), работу с MongoDB через Mongoose (схемы, валидация, populate), JWT авторизацию (access + refresh tokens). На frontend освоил Context API для state management, React Router для навигации, работу с формами через Formik + Yup. Столкнулся с задачей загрузки множественных изображений — реализовал через multer с оптимизацией изображений на лету (sharp). Особое внимание уделил безопасности: защита от XSS, CSRF, SQL injection (хотя использую NoSQL), rate limiting.",
      "careerAchievements": [
        "Создал полноценный fullstack интернет-магазин с нуля",
        "Реализовал secure авторизацию с JWT и refresh tokens",
        "Разработал админ-панель с 15+ функциями управления"
      ],
      "personalGrowth": [
        "Освоил MERN стек (MongoDB, Express, React, Node.js)",
        "Изучил построение RESTful API и best practices",
        "Получил опыт работы с MongoDB и Mongoose",
        "Научился думать о безопасности web приложений"
      ],
      "technologies": ["React", "Node.js", "Express", "MongoDB"],
      "type": "pet",
      "year": 2023,
      "status": "deprecated",
      "image": "/projects/ecommerce.jpg",
      "link": null,
      "features": [
        "Каталог товаров",
        "Корзина и оформление заказа",
        "Админ-панель",
        "Управление товарами"
      ],
      "screenshots": [],
      "hoursSpent": 160,
      "complexity": 6,
      "duration": "2 месяца"
    },
    {
      "id": "8",
      "slug": "8",
      "title": "Messenger Clone",
      "shortDescription": "Клон Telegram с Socket.io",
      "fullDescription": "Real-time мессенджер с чатами, группами, обменом файлами. Использовал Socket.io для мгновенной передачи сообщений.",
      "detailedDescription": "Messenger Clone — это мой pet-project для изучения real-time технологий, вдохновленный Telegram. Реализовал ключевые фичи мессенджера: приватные чаты 1-на-1, групповые чаты с ролями (admin, member), отправку текстовых сообщений, изображений, файлов, голосовых сообщений, индикаторы 'печатает...', статусы 'прочитано/доставлено', поиск по сообщениям и контактам. Использовал Vue 3 на frontend, Node.js + Express на backend, Socket.io для WebSocket соединений, PostgreSQL для хранения данных. Реализовал E2E шифрование для приватных чатов (использовал Web Crypto API).",
      "developmentExperience": "Это был мой первый серьезный проект с WebSocket и real-time коммуникациями. Основной челлендж — синхронизация состояния между клиентами: когда пользователь А отправляет сообщение пользователю Б, оба должны мгновенно увидеть его с правильным порядком. Реализовал через систему acknowledgments в Socket.io. Столкнулся с проблемой масштабирования — при большом количестве пользователей один Socket.io сервер не справлялся, изучил Redis adapter для горизонтального масштабирования. Работа с файлами: реализовал chunked upload для больших файлов, генерацию thumbnails для изображений, хранение в S3.",
      "careerAchievements": [
        "Создал fullstack real-time мессенджер с нуля",
        "Реализовал E2E шифрование для приватных чатов",
        "Внедрил систему масштабирования через Redis adapter"
      ],
      "personalGrowth": [
        "Освоил WebSocket и Socket.io",
        "Изучил real-time архитектуры и best practices",
        "Получил опыт работы с MongoDB и Prisma",
        "Научился работать с криптографией и Web Crypto API"
      ],
      "technologies": ["Next.js", "React", "Socket.io", "Prisma", "MongoDB"],
      "type": "pet",
      "year": 2022,
      "status": "deprecated",
      "image": "/projects/messenger.jpg",
      "link": null,
      "features": [
        "Real-time чаты",
        "Групповые чаты",
        "Обмен файлами",
        "Socket.io интеграция"
      ],
      "screenshots": [],
      "hoursSpent": 200,
      "complexity": 8,
      "duration": "2.5 месяца"
    },
    {
      "id": "9",
      "slug": "9",
      "title": "Backend для legacy CRM",
      "shortDescription": "Разработка API с нуля для CRM с legacy базой данных на 1200+ таблиц",
      "fullDescription": "Создал backend на Express.js для существующей CRM, проанализировав legacy БД и построив корректные выборки данных.",
      "detailedDescription": "Заказчик имел CRM-систему с накопившейся за годы базой данных, но без работающего backend — только дамп MySQL. База содержала более 1200 таблиц: система переписывалась несколько раз, и старые структуры оставались рядом с новыми. Моя задача — проанализировать БД, понять какие таблицы актуальны, и написать backend с нуля, который вытягивает корректные данные по нужным полям.",
      "developmentExperience": "Основной вызов — реверс-инжиниринг базы данных без документации. Приходилось разбираться в логике по названиям таблиц, связям между ними и самим данным. Написал backend на Express.js, настроил CI/CD и задеплоил на Vercel — позже понял, что это не лучшее решение для backend, но на тот момент это был полезный урок. Работа с заказчиком тоже была вызовом: нужно было вытягивать контекст о том, как система развивалась исторически.",
      "careerAchievements": [
        "Проанализировал legacy БД из 1200+ таблиц без документации",
        "Разработал backend на Express.js с нуля",
        "Настроил CI/CD и деплой, довёл проект до продакшена"
      ],
      "personalGrowth": [
        "Научился анализировать legacy БД через реверс-инжиниринг",
        "Получил fullstack + DevOps опыт на одном проекте",
        "Понял ограничения serverless для backend (Vercel)",
        "Улучшил навыки коммуникации со сложными заказчиками"
      ],
      "technologies": ["Express.js", "MySQL", "Vercel", "CI/CD"],
      "type": "commercial",
      "year": 2023,
      "status": "completed",
      "image": "/projects/crm-data-layer.jpg",
      "link": null,
      "features": [
        "REST API",
        "Анализ legacy БД",
        "CI/CD pipeline"
      ],
      "screenshots": [],
      "hoursSpent": 160,
      "complexity": 8,
      "team": "2 человека",
      "duration": "2 месяца"
    },
    {
      "id": "10",
      "slug": "10",
      "title": "Платформа запросов и потребностей",
      "shortDescription": "Marketplace для размещения заявок и поиска исполнителей",
      "fullDescription": "Работал над фронтендом платформы объявлений. Реализовывал систему фильтрации и модуль интересов пользователя.",
      "detailedDescription": "Quest Request — платформа для размещения потребностей и поиска исполнителей. Я присоединился к существующей команде как дополнительный фронтенд-разработчик. Моей задачей была реализация системы фильтров для поиска объявлений и модуля интересов, позволяющего персонализировать выдачу для пользователя.",
      "developmentExperience": "Этот проект стал для меня важным уроком. Стек включал Vue 3 с Effector — state manager, с которым я столкнулся впервые. Мне не удалось быстро освоить его концепции (stores, effects, events), что критически замедлило работу. Главная ошибка — я слишком долго пытался разобраться самостоятельно вместо того, чтобы сразу обозначить проблему команде и скорректировать сроки. В итоге проект получил убытки из-за сорванных дедлайнов. Этот опыт научил меня двум важным вещам: честно оценивать свои возможности при работе с незнакомым стеком и не замалчивать проблемы — лучше сразу сказать о трудностях, чем подвести команду в конце.",
      "careerAchievements": [
        "Получил опыт работы с Effector и реактивным state management",
        "Научился интегрироваться в существующую команду и кодовую базу",
        "Осознал важность прозрачной коммуникации о сроках и проблемах"
      ],
      "personalGrowth": [
        "Понял важность честной оценки дедлайнов при работе с незнакомым стеком",
        "Научился не замалчивать проблемы и вовремя просить помощь",
        "Получил мотивацию глубже изучить паттерны state management",
        "Осознал, что признание трудностей — это профессионализм, а не слабость"
      ],
      "technologies": ["Vue 3", "TypeScript", "Effector"],
      "type": "commercial",
      "year": 2024,
      "status": "incomplete",
      "image": "/projects/quest-request.jpg",
      "link": "https://qrq.ru/",
      "features": [
        "Система фильтрации",
        "Модуль интересов пользователя"
      ],
      "screenshots": [],
      "hoursSpent": null,
      "complexity": 10,
      "team": "присоединился к существующей команде",
      "duration": "2 месяца"
    }
  ]
}